---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCImportOptions.GetConversionData
source: html/e4cd397e-8e29-ca75-4a92-ab8efd557ea1.htm
---
# Autodesk.Revit.DB.IFC.IFCImportOptions.GetConversionData Method

Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.

## Syntax (C#)
```csharp
public LinkConversionData GetConversionData()
```